```An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # digitalocean_kubernetes_cluster.main[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "digitalocean_kubernetes_cluster" "main" {
      [32m+[0m [0m[1m[0mcluster_subnet[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mcreated_at[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mendpoint[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mipv4_address[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mkube_config[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m           = "main"
      [32m+[0m [0m[1m[0mregion[0m[0m         = "ams3"
      [32m+[0m [0m[1m[0mservice_subnet[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mupdated_at[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m        = "1.14.1-do.4"

      [32m+[0m [0mnode_pool {
          [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m       = "budget-pool"
          [32m+[0m [0m[1m[0mnode_count[0m[0m = 3
          [32m+[0m [0m[1m[0mnodes[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0msize[0m[0m       = "s-1vcpu-2gb"
          [32m+[0m [0m[1m[0mtags[0m[0m       = [
              [32m+[0m [0m"budget",
            ]
        }
    }

[1m  # helm_release.grafana[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "helm_release" "grafana" {
      [32m+[0m [0m[1m[0mchart[0m[0m            = "stable/grafana"
      [32m+[0m [0m[1m[0mdisable_webhooks[0m[0m = false
      [32m+[0m [0m[1m[0mforce_update[0m[0m     = false
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "grafana"
      [32m+[0m [0m[1m[0mnamespace[0m[0m        = "monitoring"
      [32m+[0m [0m[1m[0mrecreate_pods[0m[0m    = false
      [32m+[0m [0m[1m[0mreuse[0m[0m            = false
      [32m+[0m [0m[1m[0mreuse_values[0m[0m     = false
      [32m+[0m [0m[1m[0mstatus[0m[0m           = "DEPLOYED"
      [32m+[0m [0m[1m[0mtimeout[0m[0m          = 600
      [32m+[0m [0m[1m[0mvalues[0m[0m           = [
          [32m+[0m [0m"ingress:\n  enabled: true\n  hosts:\n    - grafana.codecomet.io\n\npersistence:\n  enabled: true\n  accessModes:\n    - ReadWriteOnce\n  size: 10Gi\n\nplugins:\n  - grafana-piechart-panel\n\ndatasources:\n  datasources.yaml:\n    apiVersion: 1\n    datasources:\n    - name: Prometheus\n      type: prometheus\n      url: http://prometheus-server\n      access: proxy\n      isDefault: true\n    - name: Loki\n      type: loki\n      url: http://loki:3100\n      access: proxy\n\ndashboardProviders:\n  dashboardproviders.yaml:\n    apiVersion: 1\n    providers:\n    - name: 'default'\n      orgId: 1\n      folder: ''\n      type: file\n      disableDeletion: false\n      editable: true\n      options:\n        path: /var/lib/grafana/dashboards/default\n\ndashboards:\n  default:\n    cluster-monitoring:\n      url: https://raw.githubusercontent.com/toxsickcoder/kubernetes-terraform/master/src/helm/monitoring/grafana-dashboards/cluster-monitoring.json\n    mongodb:\n      url: https://raw.githubusercontent.com/toxsickcoder/kubernetes-terraform/master/src/helm/monitoring/grafana-dashboards/mongodb.json\n    mysql:\n      url: https://raw.githubusercontent.com/toxsickcoder/kubernetes-terraform/master/src/helm/monitoring/grafana-dashboards/mysql.json\n    nodejs-express:\n      url: https://raw.githubusercontent.com/toxsickcoder/kubernetes-terraform/master/src/helm/monitoring/grafana-dashboards/nodejs-express.json\n    traefik:\n      url: https://raw.githubusercontent.com/toxsickcoder/kubernetes-terraform/master/src/helm/monitoring/grafana-dashboards/traefik.json\n",
        ]
      [32m+[0m [0m[1m[0mverify[0m[0m           = false
      [32m+[0m [0m[1m[0mversion[0m[0m          = "3.5.7"
      [32m+[0m [0m[1m[0mwait[0m[0m             = true
    }

[1m  # helm_release.loki[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "helm_release" "loki" {
      [32m+[0m [0m[1m[0mchart[0m[0m            = "loki/loki"
      [32m+[0m [0m[1m[0mdisable_webhooks[0m[0m = false
      [32m+[0m [0m[1m[0mforce_update[0m[0m     = false
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "loki"
      [32m+[0m [0m[1m[0mnamespace[0m[0m        = "monitoring"
      [32m+[0m [0m[1m[0mrecreate_pods[0m[0m    = false
      [32m+[0m [0m[1m[0mreuse[0m[0m            = false
      [32m+[0m [0m[1m[0mreuse_values[0m[0m     = false
      [32m+[0m [0m[1m[0mstatus[0m[0m           = "DEPLOYED"
      [32m+[0m [0m[1m[0mtimeout[0m[0m          = 600
      [32m+[0m [0m[1m[0mvalues[0m[0m           = [
          [32m+[0m [0m"persistence:\n  enabled: true\n  storageClassName: \"\"\n",
        ]
      [32m+[0m [0m[1m[0mverify[0m[0m           = false
      [32m+[0m [0m[1m[0mversion[0m[0m          = "0.10.0"
      [32m+[0m [0m[1m[0mwait[0m[0m             = true
    }

[1m  # helm_release.mongodb[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "helm_release" "mongodb" {
      [32m+[0m [0m[1m[0mchart[0m[0m            = "stable/mongodb"
      [32m+[0m [0m[1m[0mdisable_webhooks[0m[0m = false
      [32m+[0m [0m[1m[0mforce_update[0m[0m     = false
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "mongodb"
      [32m+[0m [0m[1m[0mnamespace[0m[0m        = "data"
      [32m+[0m [0m[1m[0mrecreate_pods[0m[0m    = false
      [32m+[0m [0m[1m[0mreuse[0m[0m            = false
      [32m+[0m [0m[1m[0mreuse_values[0m[0m     = false
      [32m+[0m [0m[1m[0mstatus[0m[0m           = "DEPLOYED"
      [32m+[0m [0m[1m[0mtimeout[0m[0m          = 600
      [32m+[0m [0m[1m[0mvalues[0m[0m           = [
          [32m+[0m [0m"replicaSet:\n  enabled: true\n\nmetrics:\n  enabled: true\n  livenessProbe:\n    enabled: true\n  readinessProbe:\n    enabled: true\n",
        ]
      [32m+[0m [0m[1m[0mverify[0m[0m           = false
      [32m+[0m [0m[1m[0mversion[0m[0m          = "5.20.3"
      [32m+[0m [0m[1m[0mwait[0m[0m             = true
    }

[1m  # helm_release.prometheus[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "helm_release" "prometheus" {
      [32m+[0m [0m[1m[0mchart[0m[0m            = "stable/prometheus"
      [32m+[0m [0m[1m[0mdisable_webhooks[0m[0m = false
      [32m+[0m [0m[1m[0mforce_update[0m[0m     = false
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "prometheus"
      [32m+[0m [0m[1m[0mnamespace[0m[0m        = "monitoring"
      [32m+[0m [0m[1m[0mrecreate_pods[0m[0m    = false
      [32m+[0m [0m[1m[0mreuse[0m[0m            = false
      [32m+[0m [0m[1m[0mreuse_values[0m[0m     = false
      [32m+[0m [0m[1m[0mstatus[0m[0m           = "DEPLOYED"
      [32m+[0m [0m[1m[0mtimeout[0m[0m          = 600
      [32m+[0m [0m[1m[0mvalues[0m[0m           = [
          [32m+[0m [0m"",
        ]
      [32m+[0m [0m[1m[0mverify[0m[0m           = false
      [32m+[0m [0m[1m[0mversion[0m[0m          = "8.14.0"
      [32m+[0m [0m[1m[0mwait[0m[0m             = true
    }

[1m  # helm_release.promtail[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "helm_release" "promtail" {
      [32m+[0m [0m[1m[0mchart[0m[0m            = "loki/promtail"
      [32m+[0m [0m[1m[0mdisable_webhooks[0m[0m = false
      [32m+[0m [0m[1m[0mforce_update[0m[0m     = false
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "promtail"
      [32m+[0m [0m[1m[0mnamespace[0m[0m        = "monitoring"
      [32m+[0m [0m[1m[0mrecreate_pods[0m[0m    = false
      [32m+[0m [0m[1m[0mreuse[0m[0m            = false
      [32m+[0m [0m[1m[0mreuse_values[0m[0m     = false
      [32m+[0m [0m[1m[0mstatus[0m[0m           = "DEPLOYED"
      [32m+[0m [0m[1m[0mtimeout[0m[0m          = 600
      [32m+[0m [0m[1m[0mvalues[0m[0m           = [
          [32m+[0m [0m"loki:\n  serviceName: \"loki\"",
        ]
      [32m+[0m [0m[1m[0mverify[0m[0m           = false
      [32m+[0m [0m[1m[0mversion[0m[0m          = "0.8.1"
      [32m+[0m [0m[1m[0mwait[0m[0m             = true
    }

[1m  # helm_release.traefik[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "helm_release" "traefik" {
      [32m+[0m [0m[1m[0mchart[0m[0m            = "stable/traefik"
      [32m+[0m [0m[1m[0mdisable_webhooks[0m[0m = false
      [32m+[0m [0m[1m[0mforce_update[0m[0m     = false
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "traefik"
      [32m+[0m [0m[1m[0mnamespace[0m[0m        = "kube-system"
      [32m+[0m [0m[1m[0mrecreate_pods[0m[0m    = false
      [32m+[0m [0m[1m[0mreuse[0m[0m            = false
      [32m+[0m [0m[1m[0mreuse_values[0m[0m     = false
      [32m+[0m [0m[1m[0mstatus[0m[0m           = "DEPLOYED"
      [32m+[0m [0m[1m[0mtimeout[0m[0m          = 600
      [32m+[0m [0m[1m[0mvalues[0m[0m           = [
          [32m+[0m [0m"ssl:\n  enabled: true\n  enforced: true\n  permanentRedirect: true\n\nacme:\n  enabled: true\n  email: freek_mencke@outlook.com\n  staging: false\n  domains:\n    enabled: true\n    domainsList:\n      - main: \"*.codecomet.io\"\n      - sans:\n        - \"codecomet.io\"\n  challengeType: dns-01\n  delayBeforeCheck: 10\n  dnsProvider:\n    name: digitalocean\n\nrbac:\n  enabled: true\n\nmetrics:\n  prometheus:\n    enabled: true\n\ndeployment:\n  podAnnotations:\n    prometheus.io/port: \"8080\"\n    prometheus.io/scrape: \"true\"\n",
        ]
      [32m+[0m [0m[1m[0mverify[0m[0m           = false
      [32m+[0m [0m[1m[0mversion[0m[0m          = "1.70.1"
      [32m+[0m [0m[1m[0mwait[0m[0m             = true

      [32m+[0m [0mset_sensitive {
          [32m+[0m [0m[1m[0mname[0m[0m = "acme.dnsProvider.digitalocean.DO_AUTH_TOKEN"
        }
    }

[1m  # kubernetes_cluster_role_binding.tiller[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "kubernetes_cluster_role_binding" "tiller" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m             = "tiller-cluster-admin"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mself_link[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
        }

      [32m+[0m [0mrole_ref {
          [32m+[0m [0m[1m[0mapi_group[0m[0m = "rbac.authorization.k8s.io"
          [32m+[0m [0m[1m[0mkind[0m[0m      = "ClusterRole"
          [32m+[0m [0m[1m[0mname[0m[0m      = "cluster-admin"
        }

      [32m+[0m [0msubject {
          [32m+[0m [0m[1m[0mapi_group[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mkind[0m[0m      = "ServiceAccount"
          [32m+[0m [0m[1m[0mname[0m[0m      = "tiller"
          [32m+[0m [0m[1m[0mnamespace[0m[0m = "kube-system"
        }
    }

[1m  # kubernetes_namespace.data[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "kubernetes_namespace" "data" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m             = "data"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mself_link[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
        }
    }

[1m  # kubernetes_namespace.monitoring[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "kubernetes_namespace" "monitoring" {
      [32m+[0m [0m[1m[0mid[0m[0m = (known after apply)

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m             = "monitoring"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mself_link[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
        }
    }

[1m  # kubernetes_service_account.tiller[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "kubernetes_service_account" "tiller" {
      [32m+[0m [0m[1m[0mautomount_service_account_token[0m[0m = true
      [32m+[0m [0m[1m[0mdefault_secret_name[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)

      [32m+[0m [0mmetadata {
          [32m+[0m [0m[1m[0mgeneration[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m             = "tiller"
          [32m+[0m [0m[1m[0mnamespace[0m[0m        = "kube-system"
          [32m+[0m [0m[1m[0mresource_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mself_link[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0muid[0m[0m              = (known after apply)
        }
    }

[0m[1mPlan:[0m 11 to add, 0 to change, 0 to destroy.[0m

```